coba perbaiki graph td
